kayrozen/ESP-Web-Car/adf-prototype/sdkconfig.defaults
# ESP-ADF Prototype — sdkconfig.defaults
# Target: ESP32-WROVER-E-N8R8

# Target
CONFIG_IDF_TARGET="esp32"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# PSRAM — 8 MB on WROVER
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TYPE_ESPPSRAM32=y
CONFIG_SPIRAM_SIZE=8388608
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
# Keep 32 KB of internal RAM reserved for critical paths
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32768
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# ADF board — no LyraT codec chip on WROVER; we use A2DP output only
# Set to "Custom" board so ADF does not try to init the LyraT ES8388 codec
CONFIG_ESP_LYRAT_V4_3_BOARD=n
CONFIG_ESP_LYRAT_MINI_V1_1_BOARD=n
CONFIG_AUDIO_BOARD_CUSTOM=y

# Bluetooth — classic only, A2DP source + AVRCP
CONFIG_BT_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_BLE_ENABLED=n
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BTC_TASK_STACK_SIZE=8192
CONFIG_BT_A2DP_SOURCE_ROLE=y
CONFIG_BT_AVRCP_ENABLE=y
CONFIG_BT_AVRCP_CT_ENABLE=y   # controller role — we send play/pause/next
CONFIG_BT_AVRCP_TG_ENABLE=y   # target role  — we receive commands from head unit

# WiFi
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE_DYNAMIC=y
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
# Coexistence — critical for WiFi+BT stability
CONFIG_ESP32_WIFI_SW_COEXIST_ENABLE=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# HTTP client — HTTPS required for BBC, Radio-Canada
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384

# FreeRTOS — dual-core, stats enabled for Phase C CPU measurement
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Task watchdog — generous timeout because HLS segment fetch can be slow
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Heap tracing off — use stats_monitor instead
CONFIG_HEAP_TRACING=n

# lwIP — bigger buffers for HLS segment download
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=20480
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=16
CONFIG_LWIP_UDP_RECVMBOX_SIZE=8
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_RCVBUF=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# Log — INFO by default, DEBUG available for deep dives
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Stack sizes
CONFIG_MAIN_TASK_STACK_SIZE=8192

# ADF audio buffers — larger for HLS segment pre-buffering
CONFIG_AUDIO_ELEMENT_RINGBUF_SIZE=8192
